"""Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:

[”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]

Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).

Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”

Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.

Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити


Також я вирішив трішки доробитиє, та все ж таки не відкидати весь останній рядок, а поскладати там ті елементи,
котрі ми маємо можливість складати”"""

lst = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]
total = []
for i  in range(0,len(lst)):
    summ = 0
    temp = lst[i].split(",")
    for temp in temp:
        try:
            summ += int(temp)
        except ValueError:
            print("Try again!")
    total.append(summ)

print(total)