# Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є літера "h" (враховуються як великі так і маленькі).
# Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".
counter = 0;
while True:
    users_input = input("Або ти введеш шось з літерою 'h', або я від тебе не відчеплюсь: ")
    counter += 1;
    if users_input.lower().find("h") != -1:
        break
    print("Ні, ну ти знущаєшся? погнали ще разочок...")

if  1 == counter:
     print(f"Ти ще норм впорався, всього {counter} спроба")
elif counter < 5:
    print(f"Ти ще норм впорався, всього {counter} спроби")
else:
    print(f"Добре, я нікому не скажу, що ти витратив на це {counter} спроб")
